{"title":"DNS Load Balancing","date":"2021-05-21T20:04:38.000Z","date_formatted":{"ll":"May 21, 2021","L":"05/21/2021","MM-DD":"05-21"},"link":"2021-05-21/DNS-Load-Balancing","tags":["Backend","DNS","Load Balancing","Network"],"categories":["Networking"],"updated":"2021-05-21T12:11:39.899Z","content":"<h1 id=\"what-is-load-balancing\">What Is Load Balancing<a title=\"#what-is-load-balancing\" href=\"#what-is-load-balancing\"></a></h1>\n<p>Load balancing is a process of distributing a set of tasks over a set of resources, with the aim of making their overall processing more efficient. It brings great benifits to your product, such as naming abstraction, fault tolerance and cost &amp; peformance benefits.<br>\nAnd there are three approaches to implement load balancing.</p>\n<ul>\n<li>DNS Load Balancing</li>\n<li>Hardware Load balancing ( i.e. F5)</li>\n<li>Software Load balancing ( i.e. Nginx)</li>\n</ul>\n<p>And today we are going to dive into the first method, DNS load balancing.</p>\n<h1 id=\"how-dns-load-balancing-works\">How DNS Load Balancing Works<a title=\"#how-dns-load-balancing-works\" href=\"#how-dns-load-balancing-works\"></a></h1>\n<p>DNS load balancing is done by giving users different IP addresses through DNS configuration when accessing services on the same domain name, thus that distributes tasks over different machines.</p>\n<p>DNS load balancing happens in a type of DNS server called authoritative nameserver. It is the end of DNS query pipeline, the server that actually holds, and is responsible for, DNS resource records. Authoritative nameserver use round-robin algorithm to hands out a different address for each query from multiple A records, operating on a rotation. So it’s also called a round-robin DNS. You can also use weighted round-robin to specify percentage of individual result been given.</p>\n<h1 id=\"cons-of-dns-load-balancing\">Cons of DNS Load Balancing<a title=\"#cons-of-dns-load-balancing\" href=\"#cons-of-dns-load-balancing\"></a></h1>\n<p>Although DNS load balancing implement load balancing in a simple way. It’s far from perfect. Here is some of the issues.</p>\n<ol>\n<li>\n<p>Not evenly-distributed. Not every client get the IP from authoritative nameserver, some are from caches. If a user makes a DNS query to a particularly high traffice recursive resolver for a perticular website, that resolver will cache the website’s IP, potentailly sending a heavy amount of traffic to that one IP;</p>\n</li>\n<li>\n<p>Reliability. DNS server cannot detect failed server, and keep providing useless IP address. Currently, there’re two solutions, a smart browser that request new IP address when meet a failed one, or a smart DNS server that drops failed A records;</p>\n</li>\n</ol>\n","plink":"http://example.com/2021-05-21/DNS-Load-Balancing/","toc":[{"id":"what-is-load-balancing","title":"What Is Load Balancing","index":"1"},{"id":"how-dns-load-balancing-works","title":"How DNS Load Balancing Works","index":"2"},{"id":"cons-of-dns-load-balancing","title":"Cons of DNS Load Balancing","index":"3"}],"reading_time":"322 words in 2 min"}